app/controllers/administracion/registrations_controller.rb

  def destroy
    @user = User.find( params[:format] )
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1