app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    authorize User
    @users = User.all